Revit 2024 API
HemisphericalLightDistribution Constructor (HemisphericalLightDistribution)
 Creates a copy of the given hemispherical light distribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public HemisphericalLightDistribution(
	HemisphericalLightDistribution other
)
Visual Basic
Public Sub New ( _
	other As HemisphericalLightDistribution _
)
Visual C++
public:
HemisphericalLightDistribution(
	HemisphericalLightDistribution^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
HemisphericalLightDistribution Class
HemisphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace